Ka3wo123/Projekt-kosze/ToF_3DCam/ToF_3DCam/ToF_3DCam/board/pin_mux.h
/*! @name PIO1_21 (number 30), P17[3]/P24[6]/FC4_I2C_SDA_ARD
  @{ */
#define BOARD_TOFCAMPINS_FC4_I2C_SDA_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_FC4_I2C_SDA_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_FC4_I2C_SDA_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO1_20 (number 4), P17[1]/P24[5]/FC4_I2C_SCL_ARD
  @{ */
#define BOARD_TOFCAMPINS_FC4_I2C_SCL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_FC4_I2C_SCL_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_FC4_I2C_SCL_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO1_5 (number 31), P17[17]/P24[1]/PIO1_5_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TOFCAMPINS_TIRQ_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_TOFCAMPINS_TIRQ_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_TOFCAMPINS_TIRQ_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_TIRQ_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_TIRQ_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_8 (number 24), P17[19]/PIO1_8_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TOFCAMPINS_TRST_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_TOFCAMPINS_TRST_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_TOFCAMPINS_TRST_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_TRST_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_TRST_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_11 (number 93), P17[6]/PIO1_11_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TOFCAMPINS_TLPn_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_TOFCAMPINS_TLPn_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_TOFCAMPINS_TLPn_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_TOFCAMPINS_TLPn_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_TOFCAMPINS_TLPn_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_ToFCamPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_27_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_27_FUNC_ALT1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_24_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO1_24_FUNC_ALT1 0x01u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void MWM_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_13_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_13_FUNC_ALT1 0x01u
/*!
 * @brief
 * Configures I2C features for standard mode, fast mode, and Fast Mode Plus operation and High-Speed mode
 * operation.
 * : I2C 10 ns glitch filter enabled.
 * Typically used for High-speed mode I2C.
 */
#define PIO0_13_I2CFILTER_STANDARD_MODE 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_14_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_14_FUNC_ALT1 0x01u
/*!
 * @brief
 * Configures I2C features for standard mode, fast mode, and Fast Mode Plus operation and High-Speed mode
 * operation.
 * : I2C 10 ns glitch filter enabled.
 * Typically used for High-speed mode I2C.
 */
#define PIO0_14_I2CFILTER_STANDARD_MODE 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_28_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_28_FUNC_ALT0 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_2_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO0_2_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_2_MODE_INACTIVE 0x00u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_3_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_3_FUNC_ALT1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_4_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_6_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_6_FUNC_ALT1 0x01u

/*! @name PIO0_2 (number 81), U6[11]/P20[5]/FC3_SPI_MISO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMODPINS_LCD_DC_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMODPINS_LCD_DC_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMODPINS_LCD_DC_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMODPINS_LCD_DC_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPMODPINS_LCD_DC_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO0_28 (number 66), U18[3]/USB0_OVERCURRENT_N
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPMODPINS_LCD_RST_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMODPINS_LCD_RST_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */
#define BOARD_INITPMODPINS_LCD_RST_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPMODPINS_LCD_RST_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPMODPINS_LCD_RST_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMODPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
